## Plan Result (test-backendappgateway)




<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[1]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-perftest-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_application_gateway.ag[1] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw"
        name                = "cft-aks01-perftest-agw"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (4 unchanged attributes hidden)


      + backend_address_pool {
          + ip_addresses = [
              + "10.48.79.250",
              + "10.48.95.250",
            ]
          + name         = "ts-translation-service"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "ts-translation-service"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "ts-translation-service"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }




      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "ts-translation-service-perftest.service.core-compute-perftest.internal"
          + name                           = "ts-translation-service"
          + protocol                       = "Http"
        }


      + probe {
          + host                                      = "ts-translation-service-perftest.service.core-compute-perftest.internal"
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "ts-translation-service"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }

      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/adoption-cos-api" -> null
          - backend_address_pool_name  = "adoption-cos-api" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/adoption-cos-api" -> null
          - backend_http_settings_name = "adoption-cos-api" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/adoption-cos-api" -> null
          - http_listener_name         = "adoption-cos-api" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/adoption-cos-api" -> null
          - name                       = "adoption-cos-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/adoption-cos-api"
          + backend_address_pool_name  = "adoption-cos-api"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/adoption-cos-api"
          + backend_http_settings_name = "adoption-cos-api"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/adoption-cos-api"
          + http_listener_name         = "adoption-cos-api"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/adoption-cos-api"
          + name                       = "adoption-cos-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/et-sya-api" -> null
          - backend_address_pool_name  = "et-sya-api" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/et-sya-api" -> null
          - backend_http_settings_name = "et-sya-api" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/et-sya-api" -> null
          - http_listener_name         = "et-sya-api" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/et-sya-api" -> null
          - name                       = "et-sya-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/et-sya-api"
          + backend_address_pool_name  = "et-sya-api"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/et-sya-api"
          + backend_http_settings_name = "et-sya-api"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/et-sya-api"
          + http_listener_name         = "et-sya-api"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/et-sya-api"
          + name                       = "et-sya-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/hmc-cft-hearing-service" -> null
          - backend_address_pool_name  = "hmc-cft-hearing-service" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/hmc-cft-hearing-service" -> null
          - backend_http_settings_name = "hmc-cft-hearing-service" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/hmc-cft-hearing-service" -> null
          - http_listener_name         = "hmc-cft-hearing-service" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/hmc-cft-hearing-service" -> null
          - name                       = "hmc-cft-hearing-service" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/hmc-cft-hearing-service"
          + backend_address_pool_name  = "hmc-cft-hearing-service"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/hmc-cft-hearing-service"
          + backend_http_settings_name = "hmc-cft-hearing-service"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/hmc-cft-hearing-service"
          + http_listener_name         = "hmc-cft-hearing-service"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/hmc-cft-hearing-service"
          + name                       = "hmc-cft-hearing-service"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/hmc-hmi-inbound-adapter" -> null
          - backend_address_pool_name  = "hmc-hmi-inbound-adapter" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/hmc-hmi-inbound-adapter" -> null
          - backend_http_settings_name = "hmc-hmi-inbound-adapter" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/hmc-hmi-inbound-adapter" -> null
          - http_listener_name         = "hmc-hmi-inbound-adapter" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/hmc-hmi-inbound-adapter" -> null
          - name                       = "hmc-hmi-inbound-adapter" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/hmc-hmi-inbound-adapter"
          + backend_address_pool_name  = "hmc-hmi-inbound-adapter"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/hmc-hmi-inbound-adapter"
          + backend_http_settings_name = "hmc-hmi-inbound-adapter"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/hmc-hmi-inbound-adapter"
          + http_listener_name         = "hmc-hmi-inbound-adapter"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/hmc-hmi-inbound-adapter"
          + name                       = "hmc-hmi-inbound-adapter"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/hmc-hmi-outbound-adapter" -> null
          - backend_address_pool_name  = "hmc-hmi-outbound-adapter" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/hmc-hmi-outbound-adapter" -> null
          - backend_http_settings_name = "hmc-hmi-outbound-adapter" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/hmc-hmi-outbound-adapter" -> null
          - http_listener_name         = "hmc-hmi-outbound-adapter" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/hmc-hmi-outbound-adapter" -> null
          - name                       = "hmc-hmi-outbound-adapter" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/hmc-hmi-outbound-adapter"
          + backend_address_pool_name  = "hmc-hmi-outbound-adapter"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/hmc-hmi-outbound-adapter"
          + backend_http_settings_name = "hmc-hmi-outbound-adapter"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/hmc-hmi-outbound-adapter"
          + http_listener_name         = "hmc-hmi-outbound-adapter"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/hmc-hmi-outbound-adapter"
          + name                       = "hmc-hmi-outbound-adapter"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/ia-bail-case-api" -> null
          - backend_address_pool_name  = "ia-bail-case-api" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/ia-bail-case-api" -> null
          - backend_http_settings_name = "ia-bail-case-api" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/ia-bail-case-api" -> null
          - http_listener_name         = "ia-bail-case-api" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/ia-bail-case-api" -> null
          - name                       = "ia-bail-case-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/ia-bail-case-api"
          + backend_address_pool_name  = "ia-bail-case-api"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/ia-bail-case-api"
          + backend_http_settings_name = "ia-bail-case-api"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/ia-bail-case-api"
          + http_listener_name         = "ia-bail-case-api"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/ia-bail-case-api"
          + name                       = "ia-bail-case-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/idam-user-dashboard" -> null
          - backend_address_pool_name  = "idam-user-dashboard" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/idam-user-dashboard" -> null
          - backend_http_settings_name = "idam-user-dashboard" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/idam-user-dashboard" -> null
          - http_listener_name         = "idam-user-dashboard" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/idam-user-dashboard" -> null
          - name                       = "idam-user-dashboard" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/idam-user-dashboard"
          + backend_address_pool_name  = "idam-user-dashboard"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/idam-user-dashboard"
          + backend_http_settings_name = "idam-user-dashboard"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/idam-user-dashboard"
          + http_listener_name         = "idam-user-dashboard"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/idam-user-dashboard"
          + name                       = "idam-user-dashboard"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/plum-recipe-backend" -> null
          - backend_address_pool_name  = "plum-recipe-backend" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/plum-recipe-backend" -> null
          - backend_http_settings_name = "plum-recipe-backend" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/plum-recipe-backend" -> null
          - http_listener_name         = "plum-recipe-backend" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/plum-recipe-backend" -> null
          - name                       = "plum-recipe-backend" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/plum-recipe-backend"
          + backend_address_pool_name  = "plum-recipe-backend"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/plum-recipe-backend"
          + backend_http_settings_name = "plum-recipe-backend"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/plum-recipe-backend"
          + http_listener_name         = "plum-recipe-backend"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/plum-recipe-backend"
          + name                       = "plum-recipe-backend"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/prl-cos" -> null
          - backend_address_pool_name  = "prl-cos" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/prl-cos" -> null
          - backend_http_settings_name = "prl-cos" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/prl-cos" -> null
          - http_listener_name         = "prl-cos" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/prl-cos" -> null
          - name                       = "prl-cos" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/prl-cos"
          + backend_address_pool_name  = "prl-cos"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/prl-cos"
          + backend_http_settings_name = "prl-cos"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/prl-cos"
          + http_listener_name         = "prl-cos"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/prl-cos"
          + name                       = "prl-cos"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/prl-dgs" -> null
          - backend_address_pool_name  = "prl-dgs" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/prl-dgs" -> null
          - backend_http_settings_name = "prl-dgs" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/prl-dgs" -> null
          - http_listener_name         = "prl-dgs" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/prl-dgs" -> null
          - name                       = "prl-dgs" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/prl-dgs"
          + backend_address_pool_name  = "prl-dgs"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/prl-dgs"
          + backend_http_settings_name = "prl-dgs"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/prl-dgs"
          + http_listener_name         = "prl-dgs"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/prl-dgs"
          + name                       = "prl-dgs"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/sscs-hearings-api" -> null
          - backend_address_pool_name  = "sscs-hearings-api" -> null
          - backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/sscs-hearings-api" -> null
          - backend_http_settings_name = "sscs-hearings-api" -> null
          - http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/sscs-hearings-api" -> null
          - http_listener_name         = "sscs-hearings-api" -> null
          - id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/sscs-hearings-api" -> null
          - name                       = "sscs-hearings-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendAddressPools/sscs-hearings-api"
          + backend_address_pool_name  = "sscs-hearings-api"
          + backend_http_settings_id   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/backendHttpSettingsCollection/sscs-hearings-api"
          + backend_http_settings_name = "sscs-hearings-api"
          + http_listener_id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/httpListeners/sscs-hearings-api"
          + http_listener_name         = "sscs-hearings-api"
          + id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw/requestRoutingRules/sscs-hearings-api"
          + name                       = "sscs-hearings-api"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ts-translation-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ts-translation-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ts-translation-service"
          + id                         = (known after apply)
          + name                       = "ts-translation-service"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }



        # (54 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-perftest-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-perftest-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1220,"Program":"tfcmt","SHA1":"","Target":"test-backendappgateway","Vars":{}} -->